# Задача-1:
# Напишите скрипт, создающий директории dir_1 - dir_9 в папке,
# из которой запущен данный скрипт.
# И второй скрипт, удаляющий эти папки.

import os
print([os.rmdir(dir) for dir in os.listdir('.') if os.path.isdir(dir)])